; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v7)
             (pred_4 ?v9 ?v4)
             (pred_9 ?v12 ?v4)
             (pred_2 ?v6 ?v12 )
	     (pred_7 ?v12)
             (pred_1 ?v11)
             (pred_10 ?v9)
             (pred_11 ?v4)
             (pred_8 ?v12)
             (pred_12 ?v9)
             (pred_5 ?v12)
             (pred_3 ))



(:action op_4
:parameters (?v5 ?v8 ?v1 ?v13)
:precondition (and (pred_1 ?v5) (pred_1 ?v8) (pred_10 ?v1) (pred_11 ?v13)
          (pred_6 ?v5 ?v8) (pred_4 ?v1 ?v13)
                   (pred_9 ?v8 ?v13) (pred_7 ?v5) 
                   (pred_8 ?v8) (pred_12 ?v1))
:effect (and  (pred_5 ?v8) (not (pred_8 ?v8))))


(:action op_2
:parameters (?v5 ?v3)
:precondition (and (pred_1 ?v5) (pred_1 ?v3)
               (pred_7 ?v5) (pred_6 ?v5 ?v3) (pred_5 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v5))))

(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_1 ?v5) (pred_10 ?v1) 
                  (pred_7 ?v5) (pred_2 ?v1 ?v5) (pred_3 ))
:effect (and (pred_12 ?v1)
   (not (pred_2 ?v1 ?v5)) (not (pred_3 ))))


(:action op_3
:parameters (?v5 ?v2 ?v10)
:precondition (and (pred_1 ?v5) (pred_10 ?v2) (pred_10 ?v10)
                  (pred_7 ?v5) (pred_12 ?v10) (pred_2 ?v2 ?v5))
:effect (and (pred_12 ?v2) (pred_2 ?v10 ?v5)
        (not (pred_12 ?v10)) (not (pred_2 ?v2 ?v5))))

(:action op_1
:parameters (?v5 ?v1)
:precondition (and (pred_1 ?v5) (pred_10 ?v1) 
                  (pred_7 ?v5) (pred_12 ?v1))
:effect (and (pred_3 ) (pred_2 ?v1 ?v5) (not (pred_12 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_14 obj_04 obj_15 obj_19 obj_20 obj_02 obj_11 obj_12 obj_09 obj_21 obj_17 obj_01 obj_07 obj_06
    obj_18 obj_13 obj_05
    obj_16 obj_03 obj_22
    )

    (:init
       (pred_3)

       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_14)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_12)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_10 obj_16)
       (pred_10 obj_03)
       (pred_10 obj_22)

       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_9  obj_17 obj_18)
       (pred_9  obj_01 obj_13)
       (pred_9  obj_12 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_09)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_06)

       (pred_4  obj_16 obj_18)
       (pred_4  obj_03 obj_13)
       (pred_4  obj_22 obj_05)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_22 obj_06)
       (pred_7 obj_19)
    )

    (:goal (and
       (pred_2 obj_16 obj_07)
       (pred_2 obj_22 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_09)))
)
)

; plan
1. (op_2 obj_19 obj_20)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_20)
   goals met: 0 of 2
2. (op_2 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 2
3. (op_2 obj_02 obj_21)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_21)
   goals met: 0 of 2
4. (op_2 obj_21 obj_06)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_06)
   goals met: 0 of 2
5. (op_5 obj_06 obj_22)
   deleted: (pred_2 obj_22 obj_06) (pred_3)
   added: (pred_12 obj_22)
   goals met: 0 of 2
6. (op_2 obj_06 obj_21)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_21)
   goals met: 0 of 2
7. (op_2 obj_21 obj_02)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_02)
   goals met: 0 of 2
8. (op_2 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 2
9. (op_2 obj_20 obj_14)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_14)
   goals met: 0 of 2
10. (op_2 obj_14 obj_08)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_08)
   goals met: 0 of 2
11. (op_2 obj_08 obj_10)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_10)
   goals met: 0 of 2
12. (op_1 obj_10 obj_22)
   deleted: (pred_12 obj_22)
   added: (pred_3) (pred_2 obj_22 obj_10)
   goals met: 1 of 2
13. (op_2 obj_10 obj_08)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_08)
   goals met: 1 of 2
14. (op_2 obj_08 obj_14)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_14)
   goals met: 1 of 2
15. (op_5 obj_14 obj_16)
   deleted: (pred_2 obj_16 obj_14) (pred_3)
   added: (pred_12 obj_16)
   goals met: 1 of 2
16. (op_2 obj_14 obj_20)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_20)
   goals met: 1 of 2
17. (op_2 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 1 of 2
18. (op_2 obj_02 obj_21)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_21)
   goals met: 1 of 2
19. (op_2 obj_21 obj_06)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_06)
   goals met: 1 of 2
20. (op_2 obj_06 obj_07)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_07)
   goals met: 1 of 2
21. (op_1 obj_07 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_3) (pred_2 obj_16 obj_07)
   goals met: 2 of 2
